#include <reg52.h>
#define uint unsigned int
#define uchar unsigned char
/**********************************
ADC0832PIN口定义
**********************************/
sbit CS=P2^0;
sbit WR1=P2^1;
sbit WR2=P2^2;
sbit XFER=P2^3;	 

/**********************************
DAC0832子函数定义
**********************************/
void dac0832(uchar dig)
{
  CS=0;WR1=0;//开启一级锁存
  XFER=1;WR2=1;//关闭二级锁存
  P0=dig;//数据进入一级锁存器

  CS=1;WR1=1;//关闭一级锁存
  WR2=0;XFER=0;//开启二级锁存，数据自动进入转换器。
}
																  
/**********************************
主函数main()
**********************************/
void main()
{
    uchar i=0,j=0;   								  
	while(1)
    {
	  for(i=0;i<255;i++)
	  {
	    dac0832(i);	
	  }
	}   
}			



